xtee6/async-db/src/test/resources/soaprequest.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope
        xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xroad="http://x-road.eu/xsd/xroad.xsd"
        xmlns:id="http://x-road.eu/xsd/identifiers">
    <SOAP-ENV:Header>
        <xroad:client id:objectType="MEMBER">
            <id:xRoadInstance>EE</id:xRoadInstance>
            <id:memberClass>BUSINESS</id:memberClass>
            <id:memberCode>clientmember</id:memberCode>
        </xroad:client>
        <xroad:service id:objectType="SERVICE">
            <id:xRoadInstance>EE</id:xRoadInstance>
            <id:memberClass>BUSINESS</id:memberClass>
            <id:memberCode>servicemember</id:memberCode>
            <id:serviceCode>sendSomeAsyncStuff</id:serviceCode>
        </xroad:service>
        <xroad:userId>EE37702211234</xroad:userId>
        <xroad:id>1234567890</xroad:id>
        <xroad:async>true</xroad:async>
        <xroad:protocolVersion>4.0</xroad:protocolVersion>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns1:sendSomeAsyncStuff xmlns:ns1="http://cosumer.ee.xroad.net">
            <request>
                <name>foo</name>
                <age>35</age>
            </request>
        </ns1:sendSomeAsyncStuff>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>